stress-test-results/01-homepage-c10.txt
Running 30s test @ http://localhost:3000
10 connections


┌─────────┬────────┬────────┬────────┬─────────┬────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%     │ Avg    │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼─────────┼────────┼───────────┼─────────┤
│ Latency │ 234 ms │ 321 ms │ 753 ms │ 1192 ms │ 383 ms │ 175.87 ms │ 1296 ms │
└─────────┴────────┴────────┴────────┴─────────┴────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬──────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%  │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼──────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 10      │ 10      │ 28   │ 40      │ 26      │ 9.51    │ 10      │
├───────────┼─────────┼─────────┼──────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 1.78 MB │ 1.78 MB │ 5 MB │ 7.14 MB │ 4.64 MB │ 1.69 MB │ 1.78 MB │
└───────────┴─────────┴─────────┴──────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

790 requests in 30.09s, 139 MB read