stress-test-results/03-homepage-c100.txt
Running 30s test @ http://localhost:3000
100 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 728 ms │ 2095 ms │ 4202 ms │ 7378 ms │ 2102.84 ms │ 961.58 ms │ 9882 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬──────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%  │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼──────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 11      │ 11      │ 28   │ 49      │ 29.44   │ 10.85   │ 11      │
├───────────┼─────────┼─────────┼──────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 1.96 MB │ 1.96 MB │ 5 MB │ 8.74 MB │ 5.25 MB │ 1.93 MB │ 1.96 MB │
└───────────┴─────────┴─────────┴──────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

1k requests in 30.16s, 157 MB read
108 errors (108 timeouts)