stress-test-results/04-api-laporan-c10.txt
Running 20s test @ http://localhost:3000/api/admin/laporan
10 connections


┌─────────┬───────┬───────┬───────┬────────┬──────────┬──────────┬─────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%    │ Avg      │ Stdev    │ Max     │
├─────────┼───────┼───────┼───────┼────────┼──────────┼──────────┼─────────┤
│ Latency │ 17 ms │ 24 ms │ 68 ms │ 109 ms │ 30.95 ms │ 54.81 ms │ 1359 ms │
└─────────┴───────┴───────┴───────┴────────┴──────────┴──────────┴─────────┘
┌───────────┬─────┬──────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────┼──────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 348    │ 409    │ 318.25 │ 94.9    │ 123     │
├───────────┼─────┼──────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 108 kB │ 127 kB │ 99 kB  │ 29.5 kB │ 38.3 kB │
└───────────┴─────┴──────┴────────┴────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

0 2xx responses, 6365 non 2xx responses
6k requests in 20.04s, 1.98 MB read